zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
#include "record_board_audio.h"

#include <string.h>

#include "stm32f10x.h"
#include "audio_baremetal_compat.h"

#define AUDIO_I2C_PORT GPIOB
#define AUDIO_I2C_SCL GPIO_Pin_6
#define AUDIO_I2C_SDA GPIO_Pin_7
#define AUDIO_I2S_MCLK_PORT GPIOC
#define AUDIO_I2S_MCLK_PIN GPIO_Pin_7
#define AUDIO_I2S_WS_PORT GPIOA
#define AUDIO_I2S_WS_PIN GPIO_Pin_15
#define AUDIO_I2S_CK_PORT GPIOB
#define AUDIO_I2S_CK_PIN GPIO_Pin_3
#define AUDIO_I2S_SD_PORT GPIOB
#define AUDIO_I2S_SD_PIN GPIO_Pin_5
#define AUDIO_I2S_RX_PORT GPIOB
#define AUDIO_I2S_RX_PIN GPIO_Pin_4
#define AUDIO_AMP_PORT GPIOC
#define AUDIO_AMP_PIN GPIO_Pin_13
#define AUDIO_AMP_ENABLE() GPIO_ResetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN)
#define AUDIO_AMP_DISABLE() GPIO_SetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN)
#define ES8311_I2C_ADDR_WRITE_LOW 0x30
#define ES8311_I2C_ADDR_WRITE_HIGH 0x32
#define ES8311_I2C_READ_OFFSET 0x01
#define AUDIO_SAMPLE_RATE 48000U
#define AUDIO_TEST_TABLE_SIZE 48U
#define AUDIO_PLAYBACK_VOLUME_PERCENT 20U
#define AUDIO_MONITOR_DAC_VOLUME_REG 0xA3U
#define AUDIO_MODE_NONE 0
#define AUDIO_MODE_PLAYBACK 1
#define AUDIO_MODE_RECORD 2
#define AUDIO_DMA_BUFFER_HALFWORDS 4096U
#define AUDIO_DMA_PREROLL_HALFWORDS 1024U
#define AUDIO_DMA_GUARD_HALFWORDS 32U
#define AUDIO_DMA_CHANNEL DMA2_Channel2
#define AUDIO_I2S_READ_TIMEOUT 1000000U
#define AUDIO_RECORD_SOFT_AUTO_SELECT 0U
#define AUDIO_I2S_SOFT_BCLK_TIMEOUT 20000U
#define AUDIO_I2S_SOFT_LRCK_TIMEOUT 2000000U
#define AUDIO_I2S_SOFT_SAMPLE_DELAY_NOPS 8U
#define AUDIO_RECORD_ADC_SCALE_REG 0x20U
#define AUDIO_RECORD_ADC_VOLUME_REG 0xAFU
#define AUDIO_RECORD_MIC_PATH_REG 0x1AU
#define AUDIO_PLAYBACK_MIC_PATH_REG 0x1AU
#define AUDIO_RECORD_MONO_USE_RIGHT 0U
#define AUDIO_I2C_PROBE_ATTEMPTS 5U
#define AUDIO_I2C_PROBE_RETRY_MS 20U
#define AUDIO_I2C_RECOVERY_CLOCKS 18U
#define AUDIO_RECORD_SOFT_PEAK_WARN 24000U
#define AUDIO_RECORD_SOFT_PEAK_CLIP 30000U
#define AUDIO_RECORD_SOFT_IMBALANCE_RATIO 2U
#define AUDIO_RECORD_SOFT_PREFERRED_VARIANT 2U
#define AUDIO_DMA_WAIT_FREE_LIMIT 8000000U
static int16_t g_audio_dma_buffer[AUDIO_DMA_BUFFER_HALFWORDS];
static uint32_t g_audio_dma_write_index;
static uint32_t g_audio_dma_last_read_index;
static uint32_t g_audio_dma_read_wraps;
static uint32_t g_audio_dma_read_total;
static uint32_t g_audio_dma_write_total;
static int g_audio_dma_started;
static uint32_t g_audio_dma_underruns;

static const int16_t audio_test_wave[AUDIO_TEST_TABLE_SIZE] = {
    0, 1566, 3105, 4592, 6000, 7308, 8485, 9510,
    10392, 11012, 11590, 11876, 12000, 11876, 11590, 11012,
    10392, 9510, 8485, 7308, 6000, 4592, 3105, 1566,
    0, -1566, -3105, -4592, -6000, -7308, -8485, -9510,
    -10392, -11012, -11590, -11876, -12000, -11876, -11590, -11012,
    -10392, -9510, -8485, -7308, -6000, -4592, -3105, -1566};

static int16_t board_audio_apply_volume(int16_t sample)
{
    int32_t value = ((int32_t)sample * (int32_t)AUDIO_PLAYBACK_VOLUME_PERCENT) / 100;

    if (value > 32767)
        return 32767;
    if (value < -32768)
        return -32768;
    return (int16_t)value;
}
static uint32_t board_audio_abs16(int16_t sample)
{
    if (sample < 0)
        return (sample <= -32768) ? 32768U : (uint32_t)(-sample);
    return (uint32_t)sample;
}

static board_audio_debug_info_t g_audio_debug;
static uint32_t board_audio_dma_used_halfwords(void);
static void board_audio_update_dma_debug(void)
{
    g_audio_debug.dma_underruns = g_audio_dma_underruns;
    g_audio_debug.dma_used_halfwords = board_audio_dma_used_halfwords();
    g_audio_debug.dma_write_index = g_audio_dma_write_index;
}
static void board_audio_capture_mcu_debug(void)
{
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.spi3_i2spr = SPI3->I2SPR;
    g_audio_debug.spi3_cr2 = SPI3->CR2;
    g_audio_debug.gpioa_idr = GPIOA->IDR;
    g_audio_debug.gpiob_idr = GPIOB->IDR;
    g_audio_debug.gpioc_idr = GPIOC->IDR;
    g_audio_debug.gpioa_odr = GPIOA->ODR;
    g_audio_debug.gpiob_odr = GPIOB->ODR;
    g_audio_debug.gpioc_odr = GPIOC->ODR;
    g_audio_debug.rcc_cfgr = RCC->CFGR;
    g_audio_debug.gpio_amp_state = GPIO_ReadOutputDataBit(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    board_audio_update_dma_debug();
}

static uint8_t g_es8311_addr_write = ES8311_I2C_ADDR_WRITE_LOW;
static uint32_t g_audio_soft_i2s_variant = AUDIO_RECORD_SOFT_PREFERRED_VARIANT;

static void audio_delay_short(void)
{
    volatile int i;
    for (i = 0; i < 220; ++i)
    {
        __NOP();
    }
}

static void board_audio_set_error(int err)
{
    g_audio_debug.last_error = err;
}

static void board_audio_reset_debug(int mode)
{
    memset(&g_audio_debug, 0, sizeof(g_audio_debug));
    g_audio_debug.last_mode = mode;
    g_audio_debug.last_sample_rate = AUDIO_SAMPLE_RATE;
    g_audio_debug.i2c_probe_low_result = 99;
    g_audio_debug.i2c_probe_high_result = 99;
    g_audio_debug.i2c_probe30_addr_ack = 99;
    g_audio_debug.i2c_probe30_reg_ack = 99;
    g_audio_debug.i2c_probe30_data_ack = 99;
    g_audio_debug.i2c_probe32_addr_ack = 99;
    g_audio_debug.i2c_probe32_reg_ack = 99;
    g_audio_debug.i2c_probe32_data_ack = 99;
}

static void i2c_line_input_pullup(uint16_t pin)
{
    GPIO_InitTypeDef gpio;

    GPIO_SetBits(AUDIO_I2C_PORT, pin);
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Pin = pin;
    gpio.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(AUDIO_I2C_PORT, &gpio);
    audio_delay_short();
}

static void i2c_line_drive_low(uint16_t pin)
{
    GPIO_InitTypeDef gpio;

    GPIO_ResetBits(AUDIO_I2C_PORT, pin);
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Pin = pin;
    gpio.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_Init(AUDIO_I2C_PORT, &gpio);
    audio_delay_short();
}

static void i2c_scl_high(void)
{
    i2c_line_input_pullup(AUDIO_I2C_SCL);
}
static void i2c_scl_low(void)
{
    i2c_line_drive_low(AUDIO_I2C_SCL);
}
static void i2c_sda_high(void)
{
    i2c_line_input_pullup(AUDIO_I2C_SDA);
}
static void i2c_sda_low(void)
{
    i2c_line_drive_low(AUDIO_I2C_SDA);
}
static int i2c_sda_read(void) { return GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SDA); }
static int i2c_scl_read(void) { return GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SCL); }
static void i2c_stop(void);

static void i2c_capture_bus_state(void)
{
    g_audio_debug.i2c_scl_idle = i2c_scl_read() ? 1U : 0U;
    g_audio_debug.i2c_sda_idle = i2c_sda_read() ? 1U : 0U;
}

static void i2c_start(void)
{
    i2c_sda_high();
    i2c_scl_high();
    i2c_sda_low();
    i2c_scl_low();
}

static void i2c_stop(void)
{
    i2c_sda_low();
    i2c_scl_high();
    i2c_sda_high();
}

static int i2c_write_byte(uint8_t value)
{
    int bit;
    int ack;

