zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
    for (bit = 0; bit < 8; ++bit)
    {
        if (value & 0x80U)
            i2c_sda_high();
        else
            i2c_sda_low();
        i2c_scl_high();
        i2c_scl_low();
        value <<= 1;
    }

    i2c_sda_high();
    i2c_scl_high();
    ack = i2c_sda_read();
    i2c_scl_low();
    return ack == 0 ? 0 : -1;
}

static uint8_t i2c_read_byte(int ack)
{
    int bit;
    uint8_t value = 0;

    i2c_sda_high();
    for (bit = 0; bit < 8; ++bit)
    {
        value <<= 1;
        i2c_scl_high();
        if (i2c_sda_read())
            value |= 1U;
        i2c_scl_low();
    }

    if (ack)
        i2c_sda_low();
    else
        i2c_sda_high();
    i2c_scl_high();
    i2c_scl_low();
    i2c_sda_high();
    return value;
}

static int es8311_write_reg_to(uint8_t addr, uint8_t reg, uint8_t value)
{
    int result;

    i2c_start();
    result = i2c_write_byte(addr);
    result |= i2c_write_byte(reg);
    result |= i2c_write_byte(value);
    i2c_stop();
    i2c_capture_bus_state();
    return result;
}

static int es8311_read_reg_raw(uint8_t reg, uint8_t *value)
{
    int result;

    i2c_start();
    result = i2c_write_byte(g_es8311_addr_write);
    result |= i2c_write_byte(reg);
    i2c_start();
    result |= i2c_write_byte((uint8_t)(g_es8311_addr_write | ES8311_I2C_READ_OFFSET));
    if (result == 0)
        *value = i2c_read_byte(0);
    i2c_stop();
    i2c_capture_bus_state();
    return result;
}

static int es8311_write_reg(uint8_t reg, uint8_t value)
{
    int result = es8311_write_reg_to(g_es8311_addr_write, reg, value);

    if (result != 0)
        g_audio_debug.codec_fail_reg = reg;
    return result;
}

static int es8311_write_reg_retry(uint8_t reg, uint8_t value)
{
    uint32_t attempt;
    int result = -1;

    for (attempt = 0U; attempt < 3U; ++attempt)
    {
        result = es8311_write_reg(reg, value);
        if (result == 0)
            return 0;
        audio_delay_ms(2);
    }
    return result;
}
static int es8311_read_reg(uint8_t reg, uint8_t *value)
{
    int result = es8311_read_reg_raw(reg, value);

    if (result != 0)
        g_audio_debug.codec_fail_reg = reg;
    return result;
}

static void board_audio_capture_debug_regs(void)
{
    uint8_t value;

    if (es8311_read_reg(0x00, &value) == 0)
        g_audio_debug.codec_reg00 = value;
    if (es8311_read_reg(0x01, &value) == 0)
        g_audio_debug.codec_reg01 = value;
    if (es8311_read_reg(0x02, &value) == 0)
        g_audio_debug.codec_reg02 = value;
    if (es8311_read_reg(0x03, &value) == 0)
        g_audio_debug.codec_reg03 = value;
    if (es8311_read_reg(0x04, &value) == 0)
        g_audio_debug.codec_reg04 = value;
    if (es8311_read_reg(0x05, &value) == 0)
        g_audio_debug.codec_reg05 = value;
    if (es8311_read_reg(0x06, &value) == 0)
        g_audio_debug.codec_reg06 = value;
    if (es8311_read_reg(0x07, &value) == 0)
        g_audio_debug.codec_reg07 = value;
    if (es8311_read_reg(0x08, &value) == 0)
        g_audio_debug.codec_reg08 = value;
    if (es8311_read_reg(0x09, &value) == 0)
        g_audio_debug.codec_reg09 = value;
    if (es8311_read_reg(0x0A, &value) == 0)
        g_audio_debug.codec_reg0a = value;
    if (es8311_read_reg(0x0B, &value) == 0)
        g_audio_debug.codec_reg0b = value;
    if (es8311_read_reg(0x0C, &value) == 0)
        g_audio_debug.codec_reg0c = value;
    if (es8311_read_reg(0x0D, &value) == 0)
        g_audio_debug.codec_reg0d = value;
    if (es8311_read_reg(0x0E, &value) == 0)
        g_audio_debug.codec_reg0e = value;
    if (es8311_read_reg(0x0F, &value) == 0)
        g_audio_debug.codec_reg0f = value;
    if (es8311_read_reg(0x10, &value) == 0)
        g_audio_debug.codec_reg10 = value;
    if (es8311_read_reg(0x11, &value) == 0)
        g_audio_debug.codec_reg11 = value;
    if (es8311_read_reg(0x12, &value) == 0)
        g_audio_debug.codec_reg12 = value;
    if (es8311_read_reg(0x13, &value) == 0)
        g_audio_debug.codec_reg13 = value;
    if (es8311_read_reg(0x14, &value) == 0)
        g_audio_debug.codec_reg14 = value;
    if (es8311_read_reg(0x15, &value) == 0)
        g_audio_debug.codec_reg15 = value;
    if (es8311_read_reg(0x16, &value) == 0)
        g_audio_debug.codec_reg16 = value;
    if (es8311_read_reg(0x17, &value) == 0)
        g_audio_debug.codec_reg17 = value;
    if (es8311_read_reg(0x18, &value) == 0)
        g_audio_debug.codec_reg18 = value;
    if (es8311_read_reg(0x19, &value) == 0)
        g_audio_debug.codec_reg19 = value;
    if (es8311_read_reg(0x1A, &value) == 0)
        g_audio_debug.codec_reg1a = value;
    if (es8311_read_reg(0x1B, &value) == 0)
        g_audio_debug.codec_reg1b = value;
    if (es8311_read_reg(0x1C, &value) == 0)
        g_audio_debug.codec_reg1c = value;
    if (es8311_read_reg(0x25, &value) == 0)
        g_audio_debug.codec_reg25 = value;
    if (es8311_read_reg(0x31, &value) == 0)
        g_audio_debug.codec_reg31 = value;
    if (es8311_read_reg(0x32, &value) == 0)
        g_audio_debug.codec_reg32 = value;
    if (es8311_read_reg(0x33, &value) == 0)
        g_audio_debug.codec_reg33 = value;
    if (es8311_read_reg(0x34, &value) == 0)
        g_audio_debug.codec_reg34 = value;
    if (es8311_read_reg(0x37, &value) == 0)
        g_audio_debug.codec_reg37 = value;
    if (es8311_read_reg(0x44, &value) == 0)
        g_audio_debug.codec_reg44 = value;

    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.spi3_i2spr = SPI3->I2SPR;
    g_audio_debug.spi3_cr2 = SPI3->CR2;
    g_audio_debug.gpioa_idr = GPIOA->IDR;
    g_audio_debug.gpiob_idr = GPIOB->IDR;
    g_audio_debug.gpioc_idr = GPIOC->IDR;
    g_audio_debug.gpioa_odr = GPIOA->ODR;
    g_audio_debug.gpiob_odr = GPIOB->ODR;
    g_audio_debug.gpioc_odr = GPIOC->ODR;
    g_audio_debug.rcc_cfgr = RCC->CFGR;
    g_audio_debug.gpio_amp_state = GPIO_ReadOutputDataBit(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    g_audio_debug.i2c_scl_idle = GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SCL);
    g_audio_debug.i2c_sda_idle = GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SDA);
    board_audio_update_dma_debug();
}

static int es8311_probe_addr(uint8_t addr)
{
    int addr_ack;
    int reg_ack;
    int data_ack;

    i2c_stop();
    i2c_capture_bus_state();
    i2c_start();
    addr_ack = i2c_write_byte(addr);
    reg_ack = i2c_write_byte(0x00);
    data_ack = i2c_write_byte(0x80);
    i2c_stop();
    i2c_capture_bus_state();

