zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
    if (addr == ES8311_I2C_ADDR_WRITE_LOW)
    {
        g_audio_debug.i2c_probe30_addr_ack = addr_ack;
        g_audio_debug.i2c_probe30_reg_ack = reg_ack;
        g_audio_debug.i2c_probe30_data_ack = data_ack;
    }
    else
    {
        g_audio_debug.i2c_probe32_addr_ack = addr_ack;
        g_audio_debug.i2c_probe32_reg_ack = reg_ack;
        g_audio_debug.i2c_probe32_data_ack = data_ack;
    }

    return addr_ack | reg_ack | data_ack;
}
static int es8311_probe(void)
{
    uint32_t attempt;

    g_audio_debug.i2c_probe_low_result = 99;
    g_audio_debug.i2c_probe_high_result = 99;
    g_audio_debug.i2c_probe30_addr_ack = 99;
    g_audio_debug.i2c_probe30_reg_ack = 99;
    g_audio_debug.i2c_probe30_data_ack = 99;
    g_audio_debug.i2c_probe32_addr_ack = 99;
    g_audio_debug.i2c_probe32_reg_ack = 99;
    g_audio_debug.i2c_probe32_data_ack = 99;

    for (attempt = 0U; attempt < AUDIO_I2C_PROBE_ATTEMPTS; ++attempt)
    {
        g_audio_debug.i2c_probe_attempts = attempt + 1U;

        g_audio_debug.i2c_probe_low_result = es8311_probe_addr(ES8311_I2C_ADDR_WRITE_LOW);
        if (g_audio_debug.i2c_probe_low_result == 0)
        {
            g_es8311_addr_write = ES8311_I2C_ADDR_WRITE_LOW;
            g_audio_debug.codec_addr = g_es8311_addr_write;
            g_audio_debug.codec_fail_reg = 0U;
            return 0;
        }

        g_audio_debug.i2c_probe_high_result = es8311_probe_addr(ES8311_I2C_ADDR_WRITE_HIGH);
        if (g_audio_debug.i2c_probe_high_result == 0)
        {
            g_es8311_addr_write = ES8311_I2C_ADDR_WRITE_HIGH;
            g_audio_debug.codec_addr = g_es8311_addr_write;
            g_audio_debug.codec_fail_reg = 0U;
            return 0;
        }

        audio_delay_ms(AUDIO_I2C_PROBE_RETRY_MS);
    }

    i2c_capture_bus_state();
    g_audio_debug.codec_addr = 0;
    g_audio_debug.codec_fail_reg = 0xFFU;
    return -1;
}

static void board_audio_gpio_init(void)
{
    GPIO_InitTypeDef gpio;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);

    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Pin = AUDIO_I2C_SCL | AUDIO_I2C_SDA;
    gpio.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_Init(AUDIO_I2C_PORT, &gpio);
    i2c_sda_high();
    i2c_scl_high();
    audio_delay_ms(5);

    gpio.GPIO_Pin = AUDIO_AMP_PIN;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(AUDIO_AMP_PORT, &gpio);
    AUDIO_AMP_ENABLE();

    gpio.GPIO_Pin = AUDIO_I2S_MCLK_PIN;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(AUDIO_I2S_MCLK_PORT, &gpio);

    gpio.GPIO_Pin = AUDIO_I2S_WS_PIN;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(AUDIO_I2S_WS_PORT, &gpio);

    gpio.GPIO_Pin = AUDIO_I2S_CK_PIN | AUDIO_I2S_SD_PIN;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(AUDIO_I2S_CK_PORT, &gpio);

    gpio.GPIO_Pin = AUDIO_I2S_RX_PIN;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(AUDIO_I2S_RX_PORT, &gpio);
}

static void board_audio_gpio_init_record_inputs(void)
{
    GPIO_InitTypeDef gpio;

    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Pin = AUDIO_I2S_RX_PIN | AUDIO_I2S_SD_PIN;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(AUDIO_I2S_RX_PORT, &gpio);
}

static void board_audio_write_frame(int16_t left, int16_t right);
static void board_audio_dma_stop(void);
static void board_audio_dma_start(void);

static uint32_t board_audio_dma_read_index(void)
{
    uint32_t remaining;

    if (!g_audio_dma_started)
        return 0U;

    remaining = DMA_GetCurrDataCounter(AUDIO_DMA_CHANNEL);
    if (remaining > AUDIO_DMA_BUFFER_HALFWORDS)
        remaining = AUDIO_DMA_BUFFER_HALFWORDS;
    return (AUDIO_DMA_BUFFER_HALFWORDS - remaining) % AUDIO_DMA_BUFFER_HALFWORDS;
}

static uint32_t board_audio_dma_update_read_total(void)
{
    uint32_t read_index = board_audio_dma_read_index();

    if (read_index < g_audio_dma_last_read_index)
        g_audio_dma_read_wraps++;
    g_audio_dma_last_read_index = read_index;
    g_audio_dma_read_total = (g_audio_dma_read_wraps * AUDIO_DMA_BUFFER_HALFWORDS) + read_index;
    return g_audio_dma_read_total;
}

static uint32_t board_audio_dma_used_halfwords(void)
{
    uint32_t read_total = board_audio_dma_update_read_total();

    if (g_audio_dma_write_total <= read_total)
        return 0U;
    return g_audio_dma_write_total - read_total;
}

static uint32_t board_audio_dma_free_halfwords(void)
{
    uint32_t used = board_audio_dma_used_halfwords();

    if (used >= (AUDIO_DMA_BUFFER_HALFWORDS - AUDIO_DMA_GUARD_HALFWORDS))
        return 0U;
    return AUDIO_DMA_BUFFER_HALFWORDS - used - AUDIO_DMA_GUARD_HALFWORDS;
}

static void board_audio_dma_recover_if_underrun(void)
{
    uint32_t read_total = board_audio_dma_update_read_total();

    if (g_audio_dma_write_total <= read_total)
    {
        g_audio_dma_underruns++;
        memset(g_audio_dma_buffer, 0, sizeof(g_audio_dma_buffer));
        g_audio_dma_write_total = read_total + AUDIO_DMA_PREROLL_HALFWORDS;
        g_audio_dma_write_index = g_audio_dma_write_total % AUDIO_DMA_BUFFER_HALFWORDS;
    }
}

static int board_audio_dma_wait_free(uint32_t halfwords)
{
    uint32_t stagnant = 0U;
    uint32_t last_read_total = board_audio_dma_update_read_total();

    while (board_audio_dma_free_halfwords() < halfwords)
    {
        uint32_t read_total = board_audio_dma_update_read_total();

        if (read_total != last_read_total)
        {
            stagnant = 0U;
            last_read_total = read_total;
        }
        else if (++stagnant > AUDIO_DMA_WAIT_FREE_LIMIT)
        {
            g_audio_dma_underruns++;
            board_audio_set_error(-10);
            board_audio_update_dma_debug();
            return -1;
        }
        board_audio_dma_recover_if_underrun();
        __NOP();
    }
    return 0;
}

static int board_audio_dma_write_frame(int16_t left, int16_t right)
{
    if (!g_audio_dma_started)
    {
        board_audio_write_frame(left, right);
        return 0;
    }

    if (board_audio_dma_wait_free(2U) != 0)
        return -1;
    board_audio_dma_recover_if_underrun();
    g_audio_dma_buffer[g_audio_dma_write_index] = left;
    g_audio_dma_write_index = (g_audio_dma_write_index + 1U) % AUDIO_DMA_BUFFER_HALFWORDS;
    g_audio_dma_write_total++;
    g_audio_dma_buffer[g_audio_dma_write_index] = right;
    g_audio_dma_write_index = (g_audio_dma_write_index + 1U) % AUDIO_DMA_BUFFER_HALFWORDS;
    g_audio_dma_write_total++;
    g_audio_debug.tx_frames++;
    return 0;
}
static void board_audio_dma_stop(void)
{
    SPI_I2S_DMACmd(SPI3, SPI_I2S_DMAReq_Tx, DISABLE);
    DMA_Cmd(AUDIO_DMA_CHANNEL, DISABLE);
    g_audio_dma_started = 0;
    g_audio_dma_write_index = 0U;
    g_audio_dma_last_read_index = 0U;
    g_audio_dma_read_wraps = 0U;
    g_audio_dma_read_total = 0U;
    g_audio_dma_write_total = 0U;
}

static void board_audio_i2s_stop_quiet(void)
{
    board_audio_dma_stop();
    SPI_I2S_DMACmd(SPI3, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(SPI3, SPI_I2S_DMAReq_Rx, DISABLE);
    I2S_Cmd(SPI3, DISABLE);
    SPI_I2S_DeInit(SPI3);
}

static void board_audio_dma_start(void)
{
    DMA_InitTypeDef dma;
    uint32_t read_index;

    memset(g_audio_dma_buffer, 0, sizeof(g_audio_dma_buffer));
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
    DMA_Cmd(AUDIO_DMA_CHANNEL, DISABLE);
    DMA_DeInit(AUDIO_DMA_CHANNEL);

    dma.DMA_PeripheralBaseAddr = (uint32_t)&SPI3->DR;
    dma.DMA_MemoryBaseAddr = (uint32_t)g_audio_dma_buffer;
    dma.DMA_DIR = DMA_DIR_PeripheralDST;
    dma.DMA_BufferSize = AUDIO_DMA_BUFFER_HALFWORDS;
    dma.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma.DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    dma.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    dma.DMA_Mode = DMA_Mode_Circular;
    dma.DMA_Priority = DMA_Priority_High;
    dma.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(AUDIO_DMA_CHANNEL, &dma);

    SPI_I2S_DMACmd(SPI3, SPI_I2S_DMAReq_Tx, ENABLE);
    DMA_Cmd(AUDIO_DMA_CHANNEL, ENABLE);
    g_audio_dma_started = 1;
    read_index = board_audio_dma_read_index();
    g_audio_dma_last_read_index = read_index;
    g_audio_dma_read_wraps = 0U;
    g_audio_dma_read_total = read_index;
    g_audio_dma_write_total = g_audio_dma_read_total + AUDIO_DMA_PREROLL_HALFWORDS;
    g_audio_dma_write_index = g_audio_dma_write_total % AUDIO_DMA_BUFFER_HALFWORDS;
}

