zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
static void board_audio_dma_drain(void)
{
    uint32_t stagnant = 0U;
    uint32_t last_read_total = board_audio_dma_update_read_total();

    while (g_audio_dma_started && g_audio_dma_write_total > g_audio_dma_read_total)
    {
        uint32_t read_total = board_audio_dma_update_read_total();

        if (read_total != last_read_total)
        {
            stagnant = 0U;
            last_read_total = read_total;
        }
        else if (++stagnant > 8000000U)
        {
            break;
        }
        __NOP();
    }
    board_audio_update_dma_debug();
}
static uint32_t board_audio_i2s_freq(uint32_t sample_rate)
{
    if (sample_rate <= 9500U)
        return I2S_AudioFreq_8k;
    if (sample_rate <= 13500U)
        return I2S_AudioFreq_11k;
    if (sample_rate <= 19000U)
        return I2S_AudioFreq_16k;
    if (sample_rate <= 27000U)
        return I2S_AudioFreq_22k;
    if (sample_rate <= 38000U)
        return I2S_AudioFreq_32k;
    if (sample_rate >= 43000U && sample_rate <= 45000U)
        return I2S_AudioFreq_44k;
    return I2S_AudioFreq_48k;
}
static void board_audio_i2s_init_tx_rate(uint32_t sample_rate)
{
    I2S_InitTypeDef i2s;

    board_audio_dma_stop();
    SPI_I2S_DeInit(SPI3);
    i2s.I2S_Mode = I2S_Mode_MasterTx;
    i2s.I2S_Standard = I2S_Standard_Phillips;
    i2s.I2S_DataFormat = I2S_DataFormat_16b;
    i2s.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
    i2s.I2S_AudioFreq = board_audio_i2s_freq(sample_rate);
    i2s.I2S_CPOL = I2S_CPOL_Low;
    I2S_Init(SPI3, &i2s);
    I2S_Cmd(SPI3, ENABLE);
    board_audio_dma_start();
    g_audio_debug.last_sample_rate = sample_rate;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.spi3_i2spr = SPI3->I2SPR;
    g_audio_debug.spi3_cr2 = SPI3->CR2;
}

static void board_audio_i2s_init_tx(void)
{
    board_audio_i2s_init_tx_rate(AUDIO_SAMPLE_RATE);
}

static uint32_t board_audio_i2s_record_freq(uint32_t sample_rate)
{
    return board_audio_i2s_freq(sample_rate);
}
static void board_audio_i2s_init_rx_rate(uint32_t sample_rate)
{
    I2S_InitTypeDef i2s;

    board_audio_dma_stop();
    SPI_I2S_DeInit(SPI3);
    i2s.I2S_Mode = I2S_Mode_MasterRx;
    i2s.I2S_Standard = I2S_Standard_Phillips;
    i2s.I2S_DataFormat = I2S_DataFormat_16b;
    i2s.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
    i2s.I2S_AudioFreq = board_audio_i2s_record_freq(sample_rate);
    i2s.I2S_CPOL = I2S_CPOL_Low;
    I2S_Init(SPI3, &i2s);
    I2S_Cmd(SPI3, ENABLE);
    g_audio_debug.last_sample_rate = sample_rate;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.spi3_i2spr = SPI3->I2SPR;
    g_audio_debug.spi3_cr2 = SPI3->CR2;
}

static int board_audio_playback_key_ready(void)
{
    return (g_audio_debug.codec_addr != 0U) &&
           ((g_audio_debug.codec_reg01 & 0x3FU) == 0x3FU) &&
           ((g_audio_debug.codec_reg09 & 0x3FU) == 0x0CU);
}

static int board_audio_record_key_ready(void)
{
    return (g_audio_debug.codec_addr != 0U) &&
           ((g_audio_debug.codec_reg01 & 0x3FU) == 0x3FU) &&
           ((g_audio_debug.codec_reg0a & 0x3FU) == 0x0CU) &&
           ((g_audio_debug.codec_reg0d & 0xF0U) == 0U) &&
           ((g_audio_debug.codec_reg0e & 0x70U) == 0U) &&
           ((g_audio_debug.codec_reg14 & 0x40U) == 0U) &&
           ((g_audio_debug.codec_reg14 & 0x10U) != 0U) &&
           ((g_audio_debug.codec_reg07 & 0x10U) == 0U) &&
           (((g_audio_debug.codec_reg44 & 0x70U) == 0U) || ((g_audio_debug.codec_reg44 & 0x70U) == 0x50U));
}
static int board_audio_codec_init_playback(void)
{
    int result = 0;
    uint32_t init_fail_reg;

    if (es8311_probe() != 0)
        return -1;

    result |= es8311_write_reg(0x0D, 0xFA);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x00, 0x80);
    audio_delay_ms(5);
    result |= es8311_write_reg(0x00, 0x80);
    result |= es8311_write_reg(0x01, 0x30);
    result |= es8311_write_reg(0x02, 0x00);
    result |= es8311_write_reg(0x03, 0x10);
    result |= es8311_write_reg(0x16, 0x24);
    result |= es8311_write_reg(0x04, 0x10);
    result |= es8311_write_reg(0x05, 0x00);
    result |= es8311_write_reg(0x0B, 0x00);
    result |= es8311_write_reg(0x0C, 0x00);
    result |= es8311_write_reg(0x10, 0x1F);
    result |= es8311_write_reg(0x11, 0x7F);
    result |= es8311_write_reg(0x06, 0x0F);
    result |= es8311_write_reg(0x07, 0xFF);
    result |= es8311_write_reg(0x08, 0x04);
    result |= es8311_write_reg(0x09, 0x0C);
    result |= es8311_write_reg(0x0A, 0x0C);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x31, 0x00);
    result |= es8311_write_reg(0x32, 0xBF);
    result |= es8311_write_reg(0x33, 0x00);
    result |= es8311_write_reg(0x34, 0x00);
    result |= es8311_write_reg(0x0D, 0x01);
    audio_delay_ms(120);
    result |= es8311_write_reg(0x0E, 0x02);
    result |= es8311_write_reg(0x12, 0x01);
    result |= es8311_write_reg(0x13, 0x10);
    result |= es8311_write_reg(0x14, AUDIO_PLAYBACK_MIC_PATH_REG);
    result |= es8311_write_reg(0x0D, 0x06);
    audio_delay_ms(30);
    (void)es8311_write_reg(0x25, 0x00);
    result |= es8311_write_reg(0x01, 0x3F);

    init_fail_reg = g_audio_debug.codec_fail_reg;
    board_audio_capture_debug_regs();
    if (result == 0 || board_audio_playback_key_ready())
    {
        g_audio_debug.codec_fail_reg = 0U;
        return 0;
    }

    g_audio_debug.codec_fail_reg = init_fail_reg;
    return result;
}

static int board_audio_codec_init_record(void)
{
    int result = 0;
    uint32_t init_fail_reg;

    if (es8311_probe() != 0)
        return -1;

    result |= es8311_write_reg(0x0D, 0xFA);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x44, 0x08);
    result |= es8311_write_reg(0x00, 0x80);
    audio_delay_ms(5);
    result |= es8311_write_reg(0x00, 0x80);
    result |= es8311_write_reg(0x01, 0x30);
    result |= es8311_write_reg(0x02, 0x00);
    result |= es8311_write_reg(0x03, 0x10);
    result |= es8311_write_reg(0x04, 0x20);
    result |= es8311_write_reg(0x05, 0x00);
    result |= es8311_write_reg(0x06, 0x03);
    result |= es8311_write_reg(0x07, 0x00);
    result |= es8311_write_reg(0x08, 0xFF);
    result |= es8311_write_reg(0x09, 0x0C);
    result |= es8311_write_reg(0x0A, 0x0C);
    result |= es8311_write_reg(0x0B, 0x00);
    result |= es8311_write_reg(0x0C, 0x00);
    result |= es8311_write_reg(0x0D, 0x01);
    audio_delay_ms(120);
    result |= es8311_write_reg(0x0E, 0x02);
    result |= es8311_write_reg(0x0F, 0x00);
    result |= es8311_write_reg(0x12, 0x00);
    result |= es8311_write_reg(0x13, 0x10);
    result |= es8311_write_reg(0x14, AUDIO_RECORD_MIC_PATH_REG);
    result |= es8311_write_reg(0x15, 0x40);
    result |= es8311_write_reg(0x16, AUDIO_RECORD_ADC_SCALE_REG);
    result |= es8311_write_reg(0x17, AUDIO_RECORD_ADC_VOLUME_REG);
    result |= es8311_write_reg(0x18, 0x00);
    result |= es8311_write_reg(0x19, 0x00);
    result |= es8311_write_reg(0x1A, 0x00);
    result |= es8311_write_reg(0x1B, 0x0A);
    result |= es8311_write_reg(0x1C, 0x6A);
    result |= es8311_write_reg(0x31, 0x00);
    result |= es8311_write_reg(0x32, 0xBF);
    result |= es8311_write_reg(0x33, 0x00);
    result |= es8311_write_reg(0x34, 0x00);
    result |= es8311_write_reg(0x37, 0x08);
    result |= es8311_write_reg(0x44, 0x00);
    result |= es8311_write_reg(0x0D, 0x01);
    audio_delay_ms(30);
    result |= es8311_write_reg(0x01, 0x3F);

    init_fail_reg = g_audio_debug.codec_fail_reg;
    board_audio_capture_debug_regs();
    if (result == 0 || board_audio_record_key_ready())
    {
        g_audio_debug.codec_fail_reg = 0U;
        return 0;
    }

    g_audio_debug.codec_fail_reg = init_fail_reg;
    return result;
}

static void board_audio_write_word(int16_t value)
{
    while (SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_TXE) == RESET)
    {
    }
    SPI_I2S_SendData(SPI3, (uint16_t)value);
}

#if BOARD_AUDIO_RECORD_RX_BACKEND == BOARD_AUDIO_RECORD_RX_HARDWARE_SPI3
static void board_audio_clear_rx_overrun(void)
{
    volatile uint16_t discard;

    if (SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_OVR) != RESET)
    {
        discard = SPI_I2S_ReceiveData(SPI3);
        discard = SPI3->SR;
        (void)discard;
        g_audio_debug.rx_overruns++;
    }
}

