zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
static int board_audio_read_word(int16_t *value)
{
    uint32_t timeout = AUDIO_I2S_READ_TIMEOUT;

    board_audio_clear_rx_overrun();

    while (SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_RXNE) == RESET)
    {
        if (timeout-- == 0U)
        {
            *value = 0;
            g_audio_debug.rx_read_timeouts++;
            board_audio_set_error(-7);
            return -1;
        }
    }

    *value = (int16_t)SPI_I2S_ReceiveData(SPI3);
    return 0;
}

#endif

static void board_audio_write_frame(int16_t left, int16_t right)
{
    board_audio_write_word(left);
    board_audio_write_word(right);
    g_audio_debug.tx_frames++;
}

int board_audio_init_playback(void)
{
    board_audio_gpio_init();
    board_audio_reset_debug(AUDIO_MODE_PLAYBACK);
    board_audio_i2s_stop_quiet();
    audio_delay_ms(10);
    if (board_audio_codec_init_playback() != 0)
    {
        board_audio_capture_mcu_debug();
        board_audio_set_error(-1);
        return -1;
    }
    audio_delay_ms(10);
    board_audio_i2s_init_tx();
    audio_delay_ms(20);
    AUDIO_AMP_ENABLE();
    board_audio_capture_mcu_debug();
    return 0;
}

int board_audio_init_record_rate(uint32_t sample_rate)
{
    if (sample_rate == 0U)
        sample_rate = AUDIO_SAMPLE_RATE;

    board_audio_gpio_init();
    board_audio_reset_debug(AUDIO_MODE_RECORD);
    g_audio_debug.last_sample_rate = sample_rate;
    AUDIO_AMP_DISABLE();
    board_audio_i2s_stop_quiet();
    board_audio_gpio_init_record_inputs();
    audio_delay_ms(10);
    if (board_audio_codec_init_record() != 0)
    {
        board_audio_capture_mcu_debug();
        board_audio_set_error(-2);
        return -1;
    }
    audio_delay_ms(10);
    board_audio_i2s_init_rx_rate(sample_rate);
    board_audio_gpio_init_record_inputs();
    audio_delay_ms(20);
    AUDIO_AMP_DISABLE();
    board_audio_capture_debug_regs();
    return 0;
}

int board_audio_init_record(void)
{
    return board_audio_init_record_rate(AUDIO_SAMPLE_RATE);
}

int board_audio_init(void)
{
    return board_audio_init_playback();
}

void board_audio_set_sample_rate(uint32_t sample_rate)
{
    if (sample_rate == 0U || sample_rate == g_audio_debug.last_sample_rate)
        return;

    board_audio_i2s_init_tx_rate(sample_rate);
}

void board_audio_amp_set(int enabled)
{
    if (enabled)
        AUDIO_AMP_ENABLE();
    else
        AUDIO_AMP_DISABLE();
    board_audio_capture_debug_regs();
}

void board_audio_amp_set_pin_high(int high)
{
    if (high)
        GPIO_SetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    else
        GPIO_ResetBits(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    board_audio_capture_debug_regs();
}

int board_audio_play_pcm(const int16_t *pcm, uint32_t samples, uint32_t channels)
{
    uint32_t i;

    if (pcm == RT_NULL || samples == 0U)
    {
        board_audio_set_error(-3);
        return -1;
    }

    g_audio_debug.last_channels = channels;
    g_audio_debug.spi3_sr = SPI3->SR;
    g_audio_debug.spi3_i2scfgr = SPI3->I2SCFGR;
    g_audio_debug.gpio_amp_state = GPIO_ReadOutputDataBit(AUDIO_AMP_PORT, AUDIO_AMP_PIN);
    g_audio_debug.i2c_scl_idle = GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SCL);
    g_audio_debug.i2c_sda_idle = GPIO_ReadInputDataBit(AUDIO_I2C_PORT, AUDIO_I2C_SDA);
    board_audio_update_dma_debug();

    if (channels == 1U)
    {
        for (i = 0; i < samples; ++i)
        {
            if (board_audio_dma_write_frame(board_audio_apply_volume(pcm[i]), board_audio_apply_volume(pcm[i])) != 0)
                return -1;
        }
        board_audio_update_dma_debug();
        return 0;
    }

    if (channels == 2U)
    {
        for (i = 0; i < samples; ++i)
        {
            int32_t mixed = ((int32_t)pcm[i * 2U] + (int32_t)pcm[i * 2U + 1U]) / 2;
            int16_t sample = board_audio_apply_volume((int16_t)mixed);
            if (board_audio_dma_write_frame(sample, sample) != 0)
                return -1;
        }
        board_audio_update_dma_debug();
        return 0;
    }

    board_audio_set_error(-4);
    return -2;
}

void board_audio_drain(void)
{
    board_audio_dma_drain();
}

void board_audio_stop_playback(void)
{
    board_audio_i2s_stop_quiet();
    AUDIO_AMP_DISABLE();
    board_audio_capture_mcu_debug();
}

static void board_audio_capture_update_raw_debug(uint32_t frame_index, int16_t left, int16_t right)
{
    uint32_t i;
    uint32_t left_abs = board_audio_abs16(left);
    uint32_t right_abs = board_audio_abs16(right);

    if (left_abs > g_audio_debug.rx_left_abs_peak)
        g_audio_debug.rx_left_abs_peak = left_abs;
    if (right_abs > g_audio_debug.rx_right_abs_peak)
        g_audio_debug.rx_right_abs_peak = right_abs;
    if (left != 0)
        g_audio_debug.rx_left_nonzero++;
    if (right != 0)
        g_audio_debug.rx_right_nonzero++;

    if (frame_index < 8U)
    {
        g_audio_debug.rx_first_left[frame_index] = left;
        g_audio_debug.rx_first_right[frame_index] = right;
    }

    for (i = 0U; i < 7U; ++i)
    {
        g_audio_debug.rx_last_left[i] = g_audio_debug.rx_last_left[i + 1U];
        g_audio_debug.rx_last_right[i] = g_audio_debug.rx_last_right[i + 1U];
    }
    g_audio_debug.rx_last_left[7] = left;
    g_audio_debug.rx_last_right[7] = right;
}

static int board_audio_soft_wait_lrck_level(int high)
{
    uint32_t timeout = AUDIO_I2S_SOFT_LRCK_TIMEOUT;
    uint32_t mask = AUDIO_I2S_WS_PIN;

    while (((AUDIO_I2S_WS_PORT->IDR & mask) != 0U) != (high != 0))
    {
        if (timeout-- == 0U)
        {
            g_audio_debug.rx_soft_lrck_timeouts++;
            board_audio_set_error(-9);
            return -1;
        }
    }
    return 0;
}

static void board_audio_soft_variant_params(uint32_t variant,
                                            GPIO_TypeDef **data_port,
                                            uint16_t *data_pin_mask,
                                            uint32_t *data_pin_number,
                                            uint32_t *skip_edges,
                                            int *sample_falling)
{
    uint32_t sub_variant;

    if (variant >= BOARD_AUDIO_SOFT_I2S_VARIANT_COUNT)
        variant = 0U;

    if (variant >= 6U)
    {
        *data_port = AUDIO_I2S_SD_PORT;
        *data_pin_mask = AUDIO_I2S_SD_PIN;
        *data_pin_number = 5U;
        sub_variant = variant - 6U;
    }
    else
    {
        *data_port = AUDIO_I2S_RX_PORT;
        *data_pin_mask = AUDIO_I2S_RX_PIN;
        *data_pin_number = 4U;
        sub_variant = variant;
    }

    *skip_edges = sub_variant / 2U;
    *sample_falling = (sub_variant & 1U) ? 1 : 0;
}

