zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
static int board_audio_soft_wait_sample_edge_inline(int sample_falling)
{
    uint32_t timeout;

    if (sample_falling)
    {
        timeout = AUDIO_I2S_SOFT_BCLK_TIMEOUT;
        while ((AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN) == 0U)
        {
            if (timeout-- == 0U)
            {
                g_audio_debug.rx_soft_bclk_timeouts++;
                board_audio_set_error(-8);
                return -1;
            }
        }
        timeout = AUDIO_I2S_SOFT_BCLK_TIMEOUT;
        while ((AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN) != 0U)
        {
            if (timeout-- == 0U)
            {
                g_audio_debug.rx_soft_bclk_timeouts++;
                board_audio_set_error(-8);
                return -1;
            }
        }
    }
    else
    {
        timeout = AUDIO_I2S_SOFT_BCLK_TIMEOUT;
        while ((AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN) != 0U)
        {
            if (timeout-- == 0U)
            {
                g_audio_debug.rx_soft_bclk_timeouts++;
                board_audio_set_error(-8);
                return -1;
            }
        }
        timeout = AUDIO_I2S_SOFT_BCLK_TIMEOUT;
        while ((AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN) == 0U)
        {
            if (timeout-- == 0U)
            {
                g_audio_debug.rx_soft_bclk_timeouts++;
                board_audio_set_error(-8);
                return -1;
            }
        }
    }
    return 0;
}

static int board_audio_soft_read_channel_variant(int16_t *value,
                                                 GPIO_TypeDef *data_port,
                                                 uint16_t data_pin_mask,
                                                 uint32_t skip_edges,
                                                 int sample_falling,
                                                 uint32_t *pin_high,
                                                 uint32_t *pin_edges)
{
    uint32_t bit;
    uint32_t word = 0U;
    uint32_t skipped;
    uint32_t last_pin = data_port->IDR & data_pin_mask;

    for (skipped = 0U; skipped < skip_edges; ++skipped)
    {
        if (board_audio_soft_wait_sample_edge_inline(sample_falling) != 0)
            return -1;
    }

    for (bit = 0U; bit < 16U; ++bit)
    {
        uint32_t pin;
        uint32_t settle;

        if (board_audio_soft_wait_sample_edge_inline(sample_falling) != 0)
            return -1;
        for (settle = 0U; settle < AUDIO_I2S_SOFT_SAMPLE_DELAY_NOPS; ++settle)
            __NOP();

        pin = data_port->IDR & data_pin_mask;
        word <<= 1;
        if (pin != 0U)
        {
            word |= 1U;
            if (pin_high != RT_NULL)
                (*pin_high)++;
        }
        if (((pin != 0U) != (last_pin != 0U)) && pin_edges != RT_NULL)
            (*pin_edges)++;
        last_pin = pin;
    }

    *value = (int16_t)(uint16_t)word;
    return 0;
}
static int board_audio_capture_soft_i2s_frame_variant(int16_t *left,
                                                      int16_t *right,
                                                      GPIO_TypeDef *data_port,
                                                      uint16_t data_pin_mask,
                                                      uint32_t skip_edges,
                                                      int sample_falling,
                                                      uint32_t *pin_high,
                                                      uint32_t *pin_edges)
{
    if (board_audio_soft_wait_lrck_level(1) != 0)
        return -1;
    if (board_audio_soft_wait_lrck_level(0) != 0)
        return -1;
    if (board_audio_soft_read_channel_variant(left, data_port, data_pin_mask, skip_edges, sample_falling, pin_high, pin_edges) != 0)
        return -1;
    if (board_audio_soft_wait_lrck_level(1) != 0)
        return -1;
    if (board_audio_soft_read_channel_variant(right, data_port, data_pin_mask, skip_edges, sample_falling, pin_high, pin_edges) != 0)
        return -1;
    return 0;
}

#if BOARD_AUDIO_RECORD_RX_BACKEND == BOARD_AUDIO_RECORD_RX_SOFTWARE_PB4
static int board_audio_capture_soft_i2s_frame(int16_t *left, int16_t *right)
{
    uint32_t skip_edges;
    uint32_t data_pin_number;
    uint16_t data_pin_mask;
    GPIO_TypeDef *data_port;
    int sample_falling;

    board_audio_soft_variant_params(g_audio_soft_i2s_variant, &data_port, &data_pin_mask, &data_pin_number, &skip_edges, &sample_falling);
    g_audio_debug.rx_soft_data_pin = data_pin_number;
    if (board_audio_capture_soft_i2s_frame_variant(left,
                                                   right,
                                                   data_port,
                                                   data_pin_mask,
                                                   skip_edges,
                                                   sample_falling,
                                                   &g_audio_debug.rx_soft_pin_high,
                                                   &g_audio_debug.rx_soft_pin_edges) != 0)
        return -1;

    g_audio_debug.rx_soft_frames++;
    return 0;
}
#endif
static int board_audio_soft_variant_is_clean(const board_audio_soft_i2s_variant_info_t *variant)
{
    uint32_t peak;
    uint32_t low_peak;

    if (variant == RT_NULL || variant->score == 0U || variant->data_pin != 4U)
        return 0;
    if (variant->sample_falling != 0U)
        return 0;

    peak = variant->left_abs_peak > variant->right_abs_peak ? variant->left_abs_peak : variant->right_abs_peak;
    low_peak = variant->left_abs_peak < variant->right_abs_peak ? variant->left_abs_peak : variant->right_abs_peak;

    if (peak > AUDIO_RECORD_SOFT_PEAK_CLIP || low_peak == 0U)
        return 0;
    if (peak > (low_peak * AUDIO_RECORD_SOFT_IMBALANCE_RATIO))
        return 0;
    return 1;
}

int board_audio_probe_soft_i2s_variants(board_audio_soft_i2s_variant_info_t *info, uint32_t count)
{
    uint32_t variant;
    uint32_t best_variant = g_audio_soft_i2s_variant;
    uint32_t best_score = 0U;
    const uint32_t frames_per_variant = 64U;

    if (info == RT_NULL || count < BOARD_AUDIO_SOFT_I2S_VARIANT_COUNT)
        return -1;

    memset(info, 0, sizeof(board_audio_soft_i2s_variant_info_t) * count);

    for (variant = 0U; variant < BOARD_AUDIO_SOFT_I2S_VARIANT_COUNT; ++variant)
    {
        uint32_t frame;
        uint32_t skip_edges;
        uint32_t energy_sum = 0U;
        uint32_t left_delta_sum = 0U;
        uint32_t right_delta_sum = 0U;
        uint32_t data_pin_number;
        uint16_t data_pin_mask;
        GPIO_TypeDef *data_port;
        int sample_falling;
        int16_t prev_left = 0;
        int16_t prev_right = 0;
        int have_prev = 0;
        board_audio_soft_i2s_variant_info_t *cur = &info[variant];

        board_audio_soft_variant_params(variant, &data_port, &data_pin_mask, &data_pin_number, &skip_edges, &sample_falling);
        cur->variant = variant;
        cur->data_pin = data_pin_number;
        cur->skip_edges = skip_edges;
        cur->sample_falling = (uint32_t)sample_falling;

        for (frame = 0U; frame < frames_per_variant; ++frame)
        {
            int16_t left;
            int16_t right;
            uint32_t left_abs;
            uint32_t right_abs;

            if (board_audio_capture_soft_i2s_frame_variant(&left,
                                                           &right,
                                                           data_port,
                                                           data_pin_mask,
                                                           skip_edges,
                                                           sample_falling,
                                                           &cur->pin_high,
                                                           &cur->pin_edges) != 0)
                break;

            left_abs = board_audio_abs16(left);
            right_abs = board_audio_abs16(right);
            energy_sum += left_abs + right_abs;
            if (left_abs > cur->left_abs_peak)
                cur->left_abs_peak = left_abs;
            if (right_abs > cur->right_abs_peak)
                cur->right_abs_peak = right_abs;
            if (left != 0)
                cur->left_nonzero++;
            if (right != 0)
                cur->right_nonzero++;
            if (have_prev)
            {
                int32_t left_delta = (int32_t)left - (int32_t)prev_left;
                int32_t right_delta = (int32_t)right - (int32_t)prev_right;

                if (left != prev_left)
                    cur->left_changes++;
                if (right != prev_right)
                    cur->right_changes++;
                if (left_delta < 0)
                    left_delta = -left_delta;
                if (right_delta < 0)
                    right_delta = -right_delta;
                left_delta_sum += (uint32_t)left_delta;
                right_delta_sum += (uint32_t)right_delta;
            }
            else
            {
                cur->first_left = left;
                cur->first_right = right;
                have_prev = 1;
            }
            prev_left = left;
            prev_right = right;
            cur->last_left = left;
            cur->last_right = right;
        }

        if (frame < frames_per_variant || (cur->left_nonzero + cur->right_nonzero) == 0U || cur->pin_edges == 0U)
        {
            cur->score = 0U;
        }
        else
        {
            uint32_t delta_sum = left_delta_sum + right_delta_sum;
            uint32_t peak = cur->left_abs_peak > cur->right_abs_peak ? cur->left_abs_peak : cur->right_abs_peak;
            uint32_t low_peak = cur->left_abs_peak < cur->right_abs_peak ? cur->left_abs_peak : cur->right_abs_peak;
            uint32_t smooth_score = (energy_sum * 32U) / (delta_sum + 1U);

            cur->score = smooth_score + cur->left_nonzero + cur->right_nonzero + (cur->pin_edges / 16U);
            if (peak > AUDIO_RECORD_SOFT_PEAK_CLIP)
                cur->score /= 8U;
            else if (peak > AUDIO_RECORD_SOFT_PEAK_WARN)
                cur->score /= 2U;
            if (low_peak > 0U && peak > (low_peak * AUDIO_RECORD_SOFT_IMBALANCE_RATIO))
                cur->score /= 2U;
            if (cur->left_nonzero < (frames_per_variant / 2U) || cur->right_nonzero < (frames_per_variant / 2U))
                cur->score /= 2U;
            if (energy_sum > 0U && delta_sum > (energy_sum * 4U))
                cur->score /= 2U;
        }

        if (board_audio_soft_variant_is_clean(cur) && cur->score > best_score)
        {
            best_score = cur->score;
            best_variant = variant;
        }
    }

    if (AUDIO_RECORD_SOFT_PREFERRED_VARIANT < count &&
        board_audio_soft_variant_is_clean(&info[AUDIO_RECORD_SOFT_PREFERRED_VARIANT]))
    {
        best_variant = AUDIO_RECORD_SOFT_PREFERRED_VARIANT;
        best_score = info[AUDIO_RECORD_SOFT_PREFERRED_VARIANT].score;
    }
#if AUDIO_RECORD_SOFT_AUTO_SELECT
    if (best_score > 0U)
        g_audio_soft_i2s_variant = best_variant;
#else
    (void)best_variant;
    (void)best_score;
#endif
    return 0;
}
uint32_t board_audio_get_soft_i2s_variant(void)
{
    return g_audio_soft_i2s_variant;
}

