zyf021027/STM32F103ZE/ES8311_RECORD_LOOPBACK/AUDIO_RECORD/record_board_audio.c
void board_audio_scan_i2s_pins(uint32_t samples)
{
    uint32_t i;
    uint32_t last_mclk;
    uint32_t last_bclk;
    uint32_t last_lrck;
    uint32_t last_pb4;
    uint32_t last_pb5;

    if (samples == 0U)
        samples = 4096U;

    g_audio_debug.pin_scan_samples = samples;
    g_audio_debug.pin_scan_mclk_high = 0U;
    g_audio_debug.pin_scan_mclk_edges = 0U;
    g_audio_debug.pin_scan_bclk_high = 0U;
    g_audio_debug.pin_scan_bclk_edges = 0U;
    g_audio_debug.pin_scan_lrck_high = 0U;
    g_audio_debug.pin_scan_lrck_edges = 0U;
    g_audio_debug.pin_scan_pb4_high = 0U;
    g_audio_debug.pin_scan_pb4_edges = 0U;
    g_audio_debug.pin_scan_pb5_high = 0U;
    g_audio_debug.pin_scan_pb5_edges = 0U;

    last_mclk = AUDIO_I2S_MCLK_PORT->IDR & AUDIO_I2S_MCLK_PIN;
    last_bclk = AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN;
    last_lrck = AUDIO_I2S_WS_PORT->IDR & AUDIO_I2S_WS_PIN;
    last_pb4 = AUDIO_I2S_RX_PORT->IDR & AUDIO_I2S_RX_PIN;
    last_pb5 = AUDIO_I2S_SD_PORT->IDR & AUDIO_I2S_SD_PIN;

    for (i = 0U; i < samples; ++i)
    {
        uint32_t mclk = AUDIO_I2S_MCLK_PORT->IDR & AUDIO_I2S_MCLK_PIN;
        uint32_t bclk = AUDIO_I2S_CK_PORT->IDR & AUDIO_I2S_CK_PIN;
        uint32_t lrck = AUDIO_I2S_WS_PORT->IDR & AUDIO_I2S_WS_PIN;
        uint32_t pb4 = AUDIO_I2S_RX_PORT->IDR & AUDIO_I2S_RX_PIN;
        uint32_t pb5 = AUDIO_I2S_SD_PORT->IDR & AUDIO_I2S_SD_PIN;

        if (mclk != 0U)
            g_audio_debug.pin_scan_mclk_high++;
        if (bclk != 0U)
            g_audio_debug.pin_scan_bclk_high++;
        if (lrck != 0U)
            g_audio_debug.pin_scan_lrck_high++;
        if (pb4 != 0U)
            g_audio_debug.pin_scan_pb4_high++;
        if (pb5 != 0U)
            g_audio_debug.pin_scan_pb5_high++;

        if ((mclk != 0U) != (last_mclk != 0U))
            g_audio_debug.pin_scan_mclk_edges++;
        if ((bclk != 0U) != (last_bclk != 0U))
            g_audio_debug.pin_scan_bclk_edges++;
        if ((lrck != 0U) != (last_lrck != 0U))
            g_audio_debug.pin_scan_lrck_edges++;
        if ((pb4 != 0U) != (last_pb4 != 0U))
            g_audio_debug.pin_scan_pb4_edges++;
        if ((pb5 != 0U) != (last_pb5 != 0U))
            g_audio_debug.pin_scan_pb5_edges++;

        last_mclk = mclk;
        last_bclk = bclk;
        last_lrck = lrck;
        last_pb4 = pb4;
        last_pb5 = pb5;
    }

    board_audio_capture_mcu_debug();
}
static int16_t board_audio_select_mono_sample(int16_t left, int16_t right)
{
    uint32_t left_abs = board_audio_abs16(left);
    uint32_t right_abs = board_audio_abs16(right);

    if (left_abs == 0U && right_abs != 0U)
        return right;
    if (left_abs > AUDIO_RECORD_SOFT_PEAK_WARN && right_abs > 0U &&
        left_abs > (right_abs * AUDIO_RECORD_SOFT_IMBALANCE_RATIO))
        return right;
    return left;
}
int board_audio_capture_mono_sample(int16_t *sample)
{
    uint32_t frame_index;
    int16_t left;
    int16_t right;

    if (sample == RT_NULL)
    {
        board_audio_set_error(-5);
        return -1;
    }

    g_audio_debug.last_channels = 1U;
    frame_index = g_audio_debug.rx_frames;
#if BOARD_AUDIO_RECORD_RX_BACKEND == BOARD_AUDIO_RECORD_RX_SOFTWARE_PB4
    if (board_audio_capture_soft_i2s_frame(&left, &right) != 0)
        return -3;
#else
    if (board_audio_read_word(&left) != 0 || board_audio_read_word(&right) != 0)
        return -3;
#endif
    board_audio_capture_update_raw_debug(frame_index, left, right);
#if AUDIO_RECORD_MONO_USE_RIGHT
    *sample = right;
#else
    *sample = board_audio_select_mono_sample(left, right);
#endif
    g_audio_debug.rx_frames++;
    return 0;
}

int board_audio_capture_pcm(int16_t *pcm, uint32_t samples, uint32_t channels)
{
    uint32_t i;
    uint32_t frame_index;
    int16_t left;
    int16_t right;

    if (pcm == RT_NULL || samples == 0U)
    {
        board_audio_set_error(-5);
        return -1;
    }

    if (channels != 1U && channels != 2U)
    {
        board_audio_set_error(-6);
        return -2;
    }

    g_audio_debug.last_channels = channels;

    for (i = 0; i < samples; ++i)
    {
        frame_index = g_audio_debug.rx_frames;
#if BOARD_AUDIO_RECORD_RX_BACKEND == BOARD_AUDIO_RECORD_RX_SOFTWARE_PB4
        if (board_audio_capture_soft_i2s_frame(&left, &right) != 0)
            return -3;
#else
        if (board_audio_read_word(&left) != 0 || board_audio_read_word(&right) != 0)
            return -3;
#endif
        board_audio_capture_update_raw_debug(frame_index, left, right);
        if (channels == 1U)
            pcm[i] = left;
        else
        {
            pcm[i * 2U] = left;
            pcm[i * 2U + 1U] = right;
        }
        g_audio_debug.rx_frames++;
    }

    return 0;
}

int board_audio_play_test_tone(uint32_t duration_ms)
{
    uint32_t rate = g_audio_debug.last_sample_rate;
    uint32_t total_samples;
    uint32_t index;

    if (rate == 0U)
        rate = AUDIO_SAMPLE_RATE;
    total_samples = (rate * duration_ms) / 1000U;

    for (index = 0; index < total_samples; ++index)
    {
        if (board_audio_dma_write_frame(board_audio_apply_volume(audio_test_wave[index % AUDIO_TEST_TABLE_SIZE]), board_audio_apply_volume(audio_test_wave[index % AUDIO_TEST_TABLE_SIZE])) != 0)
            return -1;
    }
    return 0;
}

int board_audio_adc_dac_monitor(uint32_t duration_ms)
{
    uint32_t rate = g_audio_debug.last_sample_rate;
    uint32_t total_samples;
    uint32_t index;
    uint8_t old_reg44 = 0U;
    uint8_t old_reg32 = 0U;
    int result = 0;

    if (rate == 0U)
        rate = AUDIO_SAMPLE_RATE;
    total_samples = (rate * duration_ms) / 1000U;

    if (es8311_read_reg(0x44, &old_reg44) != 0)
        return -1;
    if (es8311_read_reg(0x32, &old_reg32) != 0)
        return -1;
    result |= es8311_write_reg_retry(0x32, AUDIO_MONITOR_DAC_VOLUME_REG);
    result |= es8311_write_reg_retry(0x44, (uint8_t)(old_reg44 | 0x80U));
    audio_delay_ms(20);
    AUDIO_AMP_ENABLE();
    board_audio_capture_debug_regs();

    if (g_audio_debug.last_mode == AUDIO_MODE_RECORD)
    {
        audio_delay_ms(duration_ms);
    }
    else
    {
        for (index = 0; index < total_samples; ++index)
        {
            if (board_audio_dma_write_frame(0, 0) != 0)
            {
                result = -1;
                break;
            }
        }
        board_audio_dma_drain();
    }

    result |= es8311_write_reg_retry(0x44, (uint8_t)(old_reg44 & (uint8_t)~0x80U));
    result |= es8311_write_reg_retry(0x32, old_reg32);
    AUDIO_AMP_DISABLE();
    board_audio_capture_debug_regs();
    return result == 0 ? 0 : -1;
}
int board_audio_disable_adc_dac_monitor(void)
{
    uint8_t reg44 = 0U;
    int result;

    result = es8311_read_reg(0x44, &reg44);
    if (result != 0)
        reg44 = 0U;
    result |= es8311_write_reg_retry(0x44, (uint8_t)(reg44 & (uint8_t)~0x80U));
    board_audio_capture_debug_regs();
    return result == 0 ? 0 : -1;
}
uint32_t board_audio_get_playback_volume_percent(void)
{
    return AUDIO_PLAYBACK_VOLUME_PERCENT;
}

uint32_t board_audio_get_monitor_dac_volume_reg(void)
{
    return AUDIO_MONITOR_DAC_VOLUME_REG;
}
uint32_t board_audio_get_record_adc_volume_reg(void)
{
    return AUDIO_RECORD_ADC_VOLUME_REG;
}

uint32_t board_audio_get_record_adc_scale_reg(void)
{
    return AUDIO_RECORD_ADC_SCALE_REG;
}

uint32_t board_audio_get_record_mic_path_reg(void)
{
    return AUDIO_RECORD_MIC_PATH_REG;
}
const board_audio_debug_info_t *board_audio_get_debug_info(void)
{
    return &g_audio_debug;
}
